# Pandas

Using Pandas - We can do analysis

In [7]:
import pandas as pd

In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\DELL\\Batch_Feb23_5PM'

In [5]:
os.chdir('D:\Office\Python\Rk\PYTHON_master\data')

In [6]:
os.getcwd()

'D:\\Office\\Python\\Rk\\PYTHON_master\\data'

In [32]:
df=pd.read_excel(r'example.xlsx')
print(df)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [34]:
df.head(2)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582

In [35]:
df.tail(2)

   0 First Name Last Name  Gender        Country  Age        Date    Id
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

In [36]:
df=pd.read_excel(r'example.xlsx')
new_df = df.dropna()
print(new_df.to_string())

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [ ]:
df=pd.read_excel(r'example.xlsx')
df.dropna(inplace = True)
print(df.to_string())

In [ ]:
df=pd.read_excel(r'example.xlsx')
df.fillna(130, inplace = True)
df

In [37]:
#Returns True for every row that is a duplicate, othwerwise False:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [13]:
df=pd.read_csv(r'foo.csv')
print(df)

    dummy      date loc  x
0     bar  20090101   a  1
1     bar  20090102   a  3
2     bar  20090103   a  5
3     bar  20090101   b  1
4     bar  20090102   b  3
5     bar  20090103   b  5

In [25]:
df=pd.read_json('check.json')
#print(df, index=[0]) 
print(df.to_string())

   Duration
0        60
1        60
2        60
3        45
4        45

In [27]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)
print(myvar[0])

0    1
1    7
2    2
dtype: int64
1

In [28]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)
print(myvar["y"])

x    1
y    7
z    2
dtype: int64
7

In [29]:
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [30]:
import pandas as pd
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
#load data into a DataFrame object:
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [38]:
import pandas as pd  
left = pd.DataFrame({  
   'id':[1,2,3,4,5],  
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],  
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})  
right = pd.DataFrame({  
    'id':[1,2,3,4,5],  
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],  
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})  
print(pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [39]:
data = {'Name': ['Parker', 'Smith', 'John', 'William'],  
   'Percentage': [82, 98, 91, 87],  
   'Course': ['B.Sc','B.Ed','M.Phill','BA']}  
df = pd.DataFrame(data)  
  
grouped = df.groupby('Course')  
print (df.groupby('Course').filter(lambda x: len(x) >= 1))

      Name  Percentage   Course
0   Parker          82     B.Sc
1    Smith          98     B.Ed
2     John          91  M.Phill
3  William          87       BA

In [40]:
df.dtypes

Name          object
Percentage     int64
Course        object
dtype: object

In [48]:
dtypes = {
    "first_name": "category",
    "gender": "category",
    "type": "category",
    "state": "category",
    "party": "category",
}
df = pd.read_csv("legislators-historical.csv",
    dtype=dtypes,
    usecols=list(dtypes) + ["birthday", "last_name"],
    parse_dates=["birthday"]
)

In [ ]:

SELECT state, count(name)
FROM df
GROUP BY state
ORDER BY state;

In [43]:
n_by_state = df.groupby("state")["last_name"].count()
n_by_state

state
AK      17
AL     211
AR     117
AS       2
AZ      51
CA     373
CO      93
CT     240
DC       2
DE      97
DK       9
FL     166
GA     319
GU       5
HI      25
IA     206
ID      59
IL     493
IN     345
KS     143
KY     374
LA     199
MA     427
MD     306
ME     175
MI     300
MN     162
MO     337
MS     156
MT      52
NC     360
ND      44
NE     129
NH     181
NJ     361
NM      58
NV      56
NY    1478
OH     681
OK      94
OL       2
OR      92
PA    1057
PI      13
PR      19
RI     108
SC     252
SD      51
TN     302
TX     269
UT      55
VA     435
VI       4
VT     116
WA      97
WI     199
WV     121
WY      41
Name: last_name, dtype: int64

In [46]:
n_by_state = df.groupby("state")["gender"].count()
n_by_state

state
AK      17
AL     211
AR     117
AS       2
AZ      51
CA     373
CO      93
CT     240
DC       2
DE      97
DK       9
FL     166
GA     319
GU       5
HI      25
IA     206
ID      59
IL     493
IN     345
KS     143
KY     374
LA     199
MA     427
MD     306
ME     175
MI     300
MN     162
MO     337
MS     156
MT      52
NC     360
ND      44
NE     129
NH     181
NJ     361
NM      58
NV      56
NY    1478
OH     681
OK      94
OL       2
OR      92
PA    1057
PI      13
PR      19
RI     108
SC     252
SD      51
TN     302
TX     269
UT      55
VA     435
VI       4
VT     116
WA      97
WI     199
WV     121
WY      41
Name: gender, dtype: int64

In [49]:
df.groupby(["state", "gender"])["last_name"].count()
df

,last_name,first_name,birthday,gender,type,state,party
0,Bassett,Richard,1745-04-02,M,sen,DE,Anti-Administration
1,Bland,Theodorick,1742-03-21,M,rep,VA,NaN
2,Burke,Aedanus,1743-06-16,M,rep,SC,NaN
3,Carroll,Daniel,1730-07-22,M,rep,MD,NaN
4,Clymer,George,1739-03-16,M,rep,PA,NaN
...,...,...,...,...,...,...,...
12131,Conway,Connie,1950-09-25,F,rep,CA,Republican
12132,Flores,Mayra,1986-01-01,F,rep,TX,Republican
12133,Sempolinski,Joseph,1983-02-10,M,rep,NY,Republican
12134,Inhofe,James,1934-11-17,M,sen,OK,Republican
12135,Sasse,Benjamin,1972-02-22,M,sen,NE,Republican

In [ ]:
#To more closely emulate the SQL result and push the grouped-on columns back into columns in the result, you can use as_index=False:
df.groupby(["state", "gender"], as_index=False)["last_name"].count()

In [ ]:
df.groupby("state", sort=False)["last_name"].count()

In [ ]:
#ser.str.contains("Fed").sum()
mentions_fed = df["last_name"].str.contains("Fed")
print(mentions_fed)